import { I18nLocale } from "./en";

export const ar: I18nLocale = {
	common: {
		close: "إغلاق",
		symbolNames: {
			bar: "خط",
			cross: "تقاطع",
			tripleBar: "ثلاثة خطوط",
			sharp: "علامة التحديد",
			triangle: "مثلث",
			circle: "دائرة",
		},
	},

	app: {
		bestScore: "أفضل نتيجة:",
		endOnGame: "انتهت اللعبة! نتيجتك هي",
		endOnGameWithNewScore: "أحسنت! نتيجة قياسية جديدة:",
		numberOfGames_zero: "٠ لعبة",
		numberOfGames_one: "لعبة واحدة",
		numberOfGames_two: "لعبتان",
		numberOfGames_few: "{{count}} ألعاب",
		numberOfGames_many: "{{count}} لعبة",
		numberOfGames_other: "{{count}} لعبة",
		rollDice: "رمي النرد",
		rollDice1: {
			part1: "تم إدراج الرمز الذي اخترته في الشبكة أدناه.",
			part2: "الآن، ارمِ النرد!",
		},
		settingsChangeDice:
			"النرد الآن غير متحرك ويتم رميه تلقائياً للسماح لك باللعب بشكل أسرع. يمكنك تغيير هذا في الإعدادات.",
		share: {
			shareYourScore: "شارك نتيجتك",
			sendScore: "أرسل نتيجتك إلى أصدقائك!",
			inviteFriends:
				"وادعُهم لمنافستك في نفس اللعبة (ستكون الرموز المرسومة خلال لعبتهم نفس رموزك).",
			title: "ديتراك",
			text: "🎲 حققت {{count}} في ديتراك! هل تستطيع تحقيق نتيجة أفضل؟ 🤞",
		},
		sr: {
			selectSymbol: "اختر واحداً من الرموز الستة للبدء.",
			newDraw: "سحب جديد:",
			gameFinished: "انتهت اللعبة! النتيجة:",
			gameFinishedNewHighestScore: "انتهت اللعبة! نتيجة قياسية جديدة!",
		},
		replayGame: "إعادة هذه اللعبة",
		startNewGame: "بدء لعبة جديدة",
		welcome: {
			title: "مرحباً بك في ديتراك!",
			text: "ابدأ باختيار أحد الرموز الستة أعلاه.",
		},
	},

	detrak: {
		ariaLabel: {
			column: "عمود",
			empty: "فارغ",
			row: "صف",
		},
		clickGrid1: {
			part1: "اختر خلية فارغة في الشبكة لإدخال رمز النرد الأول.",
			part2: "الهدف هو تجميع الرموز المتطابقة معاً.",
		},
		clickGrid2: {
			part1: "اختر خلية فارغة أخرى للرمز الثاني.",
			part2: "يجب أن تكون مجاورة مباشرة للرمز الأول.",
		},
		rollDice2: {
			left: "سيتم عرض النتائج في العمود الأيمن والصف السفلي.",
			legend:
				"هذا هو مفتاح النتيجة. على سبيل المثال، خمسة رموز متطابقة في صف أو عمود أو قطر تمنحك 10 نقاط.",
			right: {
				part1: "تظهر نتيجة القطر في كلا الطرفين، لذا يتم احتسابها مرتين!",
				part2: "ارمِ النرد مرة أخرى لمواصلة اللعبة.",
			},
		},
		settingsChangeScore:
			"كما يتم عرض النتيجة دائماً الآن، لذا يمكنك رؤية الصفوف/الأعمدة التي تحتاج إلى اهتمام بسرعة.",
	},

	error: {
		oops: "عذراً، حدث خطأ ما.",
		error: "حدث خطأ غير متوقع، يرجى إعادة تحميل الصفحة. نعتذر عن الإزعاج.",
		googleTranslateNote:
			"ملاحظة: إذا كنت تستخدم ميزة الترجمة في متصفح جوجل كروم لترجمة هذه الصفحة، فمن المحتمل أن تكون هذه الميزة هي سبب هذا الخطأ.",
		reload: "إعادة تحميل",
	},

	headerMenu: {
		openMenu: "فتح القائمة",
		detrak: "ديتراك",
		newFeatures: {
			title: "ميزات جديدة متوفرة!",
			description: "أنهِ لعبتك وأعد تحميل التطبيق.",
			action: "إعادة تحميل التطبيق",
		},
		install: {
			installableWebApp: "ديتراك هو تطبيق ويب قابل للتثبيت!",
			description:
				"يمكنك إضافته إلى شاشتك الرئيسية واللعب حتى بدون اتصال بالإنترنت.",
			install: "تثبيت ديتراك",
		},
		gigamicGame: "ديتراك لعبة محمية بحقوق النشر ونشرتها",
		digitalVersion: {
			madeBy: "تم إنشاء هذه النسخة الرقمية بواسطتي،",
			webDeveloper:
				"، مطور ويب مستقل، بموافقة Gigamic. شكراً مرة أخرى، Gigamic!",
		},
		writeToMe: "آمل أن تستمتع باللعبة! لا تتردد في مراسلتي على",
		rules: {
			readTheRules: "قراءة القواعد",
			rules: "قواعد اللعبة",
			part1:
				"ارمِ النرد وضع الرموز التي تحصل عليها في الشبكة لتسجيل أكبر عدد ممكن من النقاط.",
			part2:
				"تحصل على نقاط عندما تضع رموزاً متطابقة بجانب بعضها البعض، في صف أو عمود أو القطر من أسفل اليسار إلى أعلى اليمين:",
			points: {
				part1: "رمزان: +2 نقطة،",
				part2: "3 رموز: +3 نقاط،",
				part3: "4 رموز: +8 نقاط،",
				part4: "5 رموز: +10 نقاط،",
				part5: "لا رموز: -5 نقاط.",
			},
			part3:
				"يجب وضع الرمزين من النرد في خلايا متجاورة فارغة (أفقياً أو عمودياً).",
			part4:
				"لا يمكن وضع رمز واحد فقط من الرمزين. لذلك، لمنع انتهاء اللعبة قبل الأوان، تجنب عزل الخلايا.",
		},
		termsOfUse: "شروط الاستخدام",
		privacyPolicy: "سياسة الخصوصية",
		copyright: {
			originalGame: "اللعبة الأصلية",
			digitalVersion: "النسخة الرقمية",
		},
		sourceCodeAvailableAt: "الكود المصدري متاح في",
		version: "الإصدار",
		checkForUpdates: "التحقق من التحديثات",
		updateAvailable: "يتوفر تحديث، أنهِ لعبتك واضغط هنا للتحديث",
	},

	languageSelector: {
		chooseLanguage: "اختر اللغة",
		language: "اللغة",
	},

	navigationBlocker: {
		title: "هذا سيوقف اللعبة الحالية، هل أنت متأكد؟",
		description: "يرجى تأكيد رغبتك في إيقاف اللعبة الحالية.",
		confirmationCheckbox: "دائماً اطلب التأكيد قبل مقاطعة اللعبة",
		keepPlaying: "متابعة اللعب",
		stopGame: "إيقاف هذه اللعبة",
	},

	newGameDialog: {
		close: "إغلاق",
		createGame: "إنشاء لعبة",
		joinGame: "انضمام إلى لعبة",
		pickAnotherDay: "اختر يوماً آخر",
		play: "العب",
		playRandomGame: "العب لعبة عشوائية",
		playTodayGame: "العب لعبة اليوم",
		playWithFriends: "العب مع الأصدقاء",
		shareCreate: {
			scanQrCode: "اطلب من أصدقائك مسح رمز QR هذا، أو شارك الرابط معهم.",
			clickPlay: "ثم انقر على العب.",
			title: "ديتراك",
			joinMe: "🎲 انضم إلي في هذه اللعبة من ديتراك!",
			shareLink: "مشاركة الرابط",
			copyLink: "نسخ الرابط إلى الحافظة",
		},
		shareJoin: {
			useCamera: "استخدم كاميرا جهازك لمسح رمز QR للعبة.",
			openGameLink: "أو، افتح رابط اللعبة.",
			enterGameLink: "أو، أدخل رابط اللعبة أدناه وانقر على العب.",
		},
		stopGame: "إيقاف هذه اللعبة",
		title: {
			createGame: "إنشاء لعبة",
			inviteToGame: "دعوة أشخاص إلى اللعبة الحالية",
			joinGame: "انضمام إلى لعبة",
			newGame: "لعبة جديدة",
			playWithFriends: "العب مع الأصدقاء",
			welcomeToNewVersion: "مرحباً بك في النسخة الجديدة من ديتراك!",
		},
		welcome: {
			intro: "هناك طريقتان جديدتان للعب:",
			dailyGame: "لعبة اليوم",
			dailyGameDetails:
				"كل يوم، تكون تسلسل الرموز التي يتم رميها بالنرد متطابقة للجميع.",
			playWithFriends: "العب مع الأصدقاء",
			playWithFriendsDetails:
				"أنشئ لعبة وادعُ الأصدقاء للانضمام. هنا أيضاً، يكون تسلسل الرموز المرسومة أثناء اللعبة متطابقاً لك ولأصدقائك. يعمل حتى بدون اتصال بالإنترنت!",
			startPlaying: "ابدأ اللعب!",
		},
		or: "أو",
	},

	themeSelector: {
		chooseTheme: "اختر السمة",
		theme: "السمة",
		sameAsDevice: "نفس إعداد الجهاز",
		light: "فاتح",
		dark: "داكن",
	},

	settingsDialog: {
		openSettingsDialog: "فتح مربع حوار الإعدادات",
		settings: "الإعدادات",

		alwaysShowScore: {
			title: "عرض النتيجة دائماً",
			description: "يعرض نتيجتك الحالية أثناء اللعبة.",
		},

		showScoreWithContrast: {
			title: "عرض النتيجة بالتباين بدلاً من الألوان",
			description: "يستخدم درجات الرمادي بدلاً من الأحمر والأخضر والأزرق.",
		},

		showScoreLegend: {
			title: "عرض مفتاح النتيجة",
			description: "يعرض المفتاح الموجود أعلى الشبكة.",
		},

		animateDice: {
			title: "تحريك النرد عند الرمي",
			description: "يرمي النرد مع رسوم متحركة ثلاثية الأبعاد.",
		},

		autoRollDice: {
			title: "رمي النرد تلقائياً",
			notAvailableDuringTheFirstGame: "(غير متاح خلال اللعبة الأولى)",
			description:
				"يرمي النرد تلقائياً بمجرد وضع الرمزين في الشبكة. هذا يلغي إمكانية التراجع عن وضع الرمز الثاني.",
		},

		showDiceMarker: {
			title: "عرض علامة النرد",
			description: "يوضح أي رمز يجب وضعه على الشبكة.",
		},

		showConfetti: {
			title: "عرض الكونفيتي",
			description: "يطلق انفجاراً من الكونفيتي عندما تتجاوز أعلى نتيجة لك!",
		},

		gridAtBottom: {
			title: "وضع الشبكة في أسفل الشاشة",
			description: "مفيد للعب بيد واحدة على الهاتف المحمول.",
		},

		enableWakeLock: {
			title: "إبقاء الشاشة مضاءة أثناء اللعب",
			description:
				"يمنع شاشة جهازك من الإغلاق لمدة خمس دقائق أثناء اللعب. لاحظ أن بعض أجهزة Apple لا تدعم هذه الميزة.",
		},

		showNavigationAlert: {
			title: "طلب التأكيد قبل مغادرة اللعبة",
			description: "يعرض مربع حوار للتأكيد عند التنقل بعيداً أثناء اللعبة.",
		},
	},

	siteHeader: {
		detrak: "ديتراك",
	},
};
