import { I18nLocale } from "./en";

export const bn: I18nLocale = {
	common: {
		close: "বন্ধ করুন",
		symbolNames: {
			bar: "দণ্ড",
			cross: "ক্রস",
			tripleBar: "ত্রিদণ্ড",
			sharp: "তীক্ষ্ণ",
			triangle: "ত্রিভুজ",
			circle: "বৃত্ত",
		},
	},

	app: {
		bestScore: "সর্বোচ্চ স্কোর:",
		endOnGame: "শেষ! আপনার স্কোর",
		endOnGameWithNewScore: "সাবাশ! নতুন সর্বোচ্চ স্কোর:",
		numberOfGames_zero: "০টি গেম",
		numberOfGames_one: "১টি গেম",
		numberOfGames_other: "{{count}}টি গেম",
		rollDice: "পাশা ফেলুন",
		rollDice1: {
			part1: "আপনার নির্বাচিত প্রতীকটি নীচের গ্রিডে যোগ করা হয়েছে।",
			part2: "এখন, পাশা ফেলুন!",
		},
		settingsChangeDice:
			"আপনাকে দ্রুত খেলার সুবিধার্থে পাশা এখন অ্যানিমেশন ছাড়াই স্বয়ংক্রিয়ভাবে ফেলা হবে। আপনি সেটিংসে এটি পরিবর্তন করতে পারেন।",
		share: {
			shareYourScore: "আপনার স্কোর শেয়ার করুন",
			sendScore: "আপনার বন্ধুদের কাছে আপনার স্কোর পাঠান!",
			inviteFriends:
				"এবং তাদের একই গেমে চ্যালেঞ্জ করার জন্য আমন্ত্রণ জানান (তাদের গেমে যে প্রতীকগুলি আসবে তা আপনার গেমের মতোই হবে)।",
			title: "ডেট্রাক",
			text: "🎲 ডেট্রাকে {{count}} পেলাম! আপনি কি আরও ভালো করতে পারবেন? 🤞",
		},
		sr: {
			selectSymbol: "শুরু করতে ছয়টি প্রতীকের মধ্যে একটি নির্বাচন করুন।",
			newDraw: "নতুন ড্র:",
			gameFinished: "গেম শেষ! স্কোর:",
			gameFinishedNewHighestScore: "গেম শেষ! নতুন সর্বোচ্চ স্কোর!",
		},
		replayGame: "এই গেমটি আবার খেলুন",
		startNewGame: "নতুন গেম শুরু করুন",
		welcome: {
			title: "ডেট্রাকে স্বাগতম!",
			text: "উপরের ছয়টি প্রতীকের মধ্যে একটি বেছে নিয়ে শুরু করুন।",
		},
	},

	detrak: {
		ariaLabel: {
			column: "কলাম",
			empty: "খালি",
			row: "সারি",
		},
		clickGrid1: {
			part1: "প্রথম পাশার প্রতীকটি বসানোর জন্য গ্রিডে একটি খালি ঘর বেছে নিন।",
			part2: "লক্ষ্য হল একই প্রতীকগুলিকে একসাথে গ্রুপ করা।",
		},
		clickGrid2: {
			part1: "দ্বিতীয় প্রতীকের জন্য আরেকটি খালি ঘর বেছে নিন।",
			part2: "এটি প্রথমটির পাশেই হতে হবে।",
		},
		rollDice2: {
			left: "স্কোরগুলি সবচেয়ে ডান কলাম এবং সবচেয়ে নীচের সারিতে দেখানো হবে।",
			legend:
				"এটি স্কোরের লেজেন্ড। উদাহরণস্বরূপ, একটি সারি, কলাম বা বিকর্ণে পাঁচটি একই প্রতীক থাকলে 10 পয়েন্ট পাবেন।",
			right: {
				part1:
					"বিকর্ণের স্কোর দুই প্রান্তে দেখা যায়, তাই এটি দুইবার গণনা করা হয়!",
				part2: "গেম চালিয়ে যেতে আবার পাশা ফেলুন।",
			},
		},
		settingsChangeScore:
			"এছাড়াও, স্কোর এখন সবসময় দেখানো হয়, যাতে আপনি দ্রুত দেখতে পারেন কোন সারি/কলামগুলিতে মনোযোগ দেওয়া প্রয়োজন।",
	},

	error: {
		oops: "উফ, কিছু একটা ভুল হয়েছে।",
		error:
			"একটি অপ্রত্যাশিত ত্রুটি ঘটেছে, অনুগ্রহ করে পেজটি রিলোড করুন। অসুবিধার জন্য দুঃখিত।",
		googleTranslateNote:
			"নোট: আপনি যদি এই পেজ অনুবাদ করতে Google Chrome-এর অনুবাদ ফিচার ব্যবহার করে থাকেন, তাহলে এই ফিচারটিই সম্ভবত এই ত্রুটির কারণ।",
		reload: "রিলোড করুন",
	},

	headerMenu: {
		openMenu: "মেনু খুলুন",
		detrak: "ডেট্রাক",
		newFeatures: {
			title: "নতুন ফিচার উপলব্ধ!",
			description: "আপনার গেম শেষ করুন এবং অ্যাপ রিলোড করুন।",
			action: "অ্যাপ রিলোড করুন",
		},
		install: {
			installableWebApp: "ডেট্রাক একটি ইনস্টল করার যোগ্য ওয়েব অ্যাপ!",
			description:
				"আপনি এটি আপনার হোম স্ক্রিনে যোগ করতে পারেন এবং অফলাইনেও খেলতে পারেন।",
			install: "ডেট্রাক ইনস্টল করুন",
		},
		gigamicGame: "ডেট্রাক একটি কপিরাইটকৃত গেম যা প্রকাশিত হয়েছে",
		digitalVersion: {
			madeBy: "এই ডিজিটাল সংস্করণটি আমি তৈরি করেছি,",
			webDeveloper:
				", একজন স্বাধীন ওয়েব ডেভেলপার, Gigamic-এর অনুমোদনক্রমে। আবারও ধন্যবাদ, Gigamic!",
		},
		writeToMe: "আশা করি আপনি এটি উপভোগ করছেন! আমাকে লিখতে দ্বিধা করবেন না",
		rules: {
			readTheRules: "নিয়মাবলী পড়ুন",
			rules: "গেমের নিয়মাবলী",
			part1:
				"পাশা ফেলুন এবং প্রাপ্ত প্রতীকগুলি গ্রিডে বসিয়ে যতটা সম্ভব পয়েন্ট অর্জন করুন।",
			part2:
				"আপনি পয়েন্ট পান যখন একই প্রতীকগুলি একে অপরের পাশে রাখেন, একটি সারিতে, কলামে, বা বাম-নীচ থেকে ডান-উপরের বিকর্ণে:",
			points: {
				part1: "২টি প্রতীক: +২ পয়েন্ট,",
				part2: "৩টি প্রতীক: +৩ পয়েন্ট,",
				part3: "৪টি প্রতীক: +৮ পয়েন্ট,",
				part4: "৫টি প্রতীক: +১০ পয়েন্ট,",
				part5: "কোনো প্রতীক নেই: -৫ পয়েন্ট।",
			},
			part3:
				"পাশা থেকে পাওয়া দুটি প্রতীক অবশ্যই পাশাপাশি খালি ঘরে বসাতে হবে (অনুভূমিক বা উল্লম্বভাবে)।",
			part4:
				"দুটি প্রতীকের মধ্যে শুধু একটি বসানো সম্ভব নয়। তাই, গেম অকালে শেষ হওয়া এড়াতে, ঘরগুলিকে বিচ্ছিন্ন করা এড়িয়ে চলুন।",
		},
		termsOfUse: "ব্যবহারের শর্তাবলী",
		privacyPolicy: "গোপনীয়তা নীতি",
		copyright: {
			originalGame: "মূল গেম",
			digitalVersion: "ডিজিটাল সংস্করণ",
		},
		sourceCodeAvailableAt: "সোর্স কোড পাওয়া যাবে এখানে",
		version: "সংস্করণ",
		checkForUpdates: "আপডেট চেক করুন",
		updateAvailable:
			"আপডেট উপলব্ধ, আপনার গেম শেষ করুন এবং আপডেট করতে এখানে ক্লিক করুন",
	},

	languageSelector: {
		chooseLanguage: "ভাষা বেছে নিন",
		language: "ভাষা",
		changeLanguageError:
			"নতুন ভাষা সেট করার সময় একটি ত্রুটি ঘটেছে। অনুগ্রহ করে নিশ্চিত করুন যে আপনার ডিভাইসে ইন্টারনেট সংযোগ আছে, অ্যাপটি পুনরায় চালু করুন এবং আবার চেষ্টা করুন।",
	},

	navigationBlocker: {
		title: "এটি বর্তমান গেমটি বন্ধ করে দেবে, আপনি কি নিশ্চিত?",
		description:
			"অনুগ্রহ করে নিশ্চিত করুন যে আপনি বর্তমান গেমটি বন্ধ করতে চান।",
		confirmationCheckbox: "গেম বাধাগ্রস্ত করার আগে সবসময় নিশ্চিতকরণ চাইবেন",
		keepPlaying: "খেলা চালিয়ে যান",
		stopGame: "এই গেমটি বন্ধ করুন",
	},

	newGameDialog: {
		close: "বন্ধ করুন",
		createGame: "একটি গেম তৈরি করুন",
		joinGame: "একটি গেমে যোগ দিন",
		pickAnotherDay: "অন্য একটি দিন বেছে নিন",
		play: "খেলুন",
		playRandomGame: "একটি এলোমেলো গেম খেলুন",
		playTodayGame: "আজকের গেম খেলুন",
		playWithFriends: "বন্ধুদের সাথে খেলুন",
		shareCreate: {
			scanQrCode:
				"আপনার বন্ধুদের এই QR কোডটি স্ক্যান করতে বলুন, বা তাদের সাথে লিংকটি শেয়ার করুন।",
			clickPlay: "তারপর খেলুন বোতামে ক্লিক করুন।",
			title: "ডেট্রাক",
			joinMe: "🎲 ডেট্রাকের এই গেমে আমার সাথে যোগ দিন!",
			shareLink: "লিংক শেয়ার করুন",
			copyLink: "ক্লিপবোর্ডে লিংক কপি করুন",
		},
		shareJoin: {
			useCamera:
				"একটি গেমের QR কোড স্ক্যান করতে আপনার ডিভাইসের ক্যামেরা ব্যবহার করুন।",
			openGameLink: "অথবা, একটি গেমের লিংক খুলুন।",
			enterGameLink:
				"অথবা, নীচে একটি গেমের লিংক লিখুন এবং খেলুন বোতামে ক্লিক করুন।",
		},
		stopGame: "এই গেমটি বন্ধ করুন",
		title: {
			createGame: "একটি গেম তৈরি করুন",
			inviteToGame: "বর্তমান গেমে লোকজনকে আমন্ত্রণ জানান",
			joinGame: "একটি গেমে যোগ দিন",
			newGame: "নতুন গেম",
			playWithFriends: "বন্ধুদের সাথে খেলুন",
			welcomeToNewVersion: "ডেট্রাকের নতুন সংস্করণে স্বাগতম!",
		},
		welcome: {
			intro: "খেলার দুটি নতুন উপায় রয়েছে:",
			dailyGame: "দৈনিক গেম",
			dailyGameDetails:
				"প্রতিদিন, পাশা থেকে যে প্রতীকের ক্রম আসবে তা সবার জন্য একই হবে।",
			playWithFriends: "বন্ধুদের সাথে খেলুন",
			playWithFriendsDetails:
				"একটি গেম তৈরি করুন এবং লোকজনকে যোগ দিতে আমন্ত্রণ জানান। এখানেও, গেম চলাকালীন প্রতীকের ক্রম আপনার এবং আপনার বন্ধুদের জন্য একই হবে। এটি ইন্টারনেট সংযোগ ছাড়াও কাজ করে!",
			startPlaying: "খেলা শুরু করুন!",
		},
		or: "অথবা",
	},

	themeSelector: {
		chooseTheme: "থিম বেছে নিন",
		theme: "থিম",
		sameAsDevice: "ডিভাইসের মতো",
		light: "লাইট",
		dark: "ডার্ক",
	},

	settingsDialog: {
		openSettingsDialog: "সেটিংস ডায়ালগ খুলুন",
		settings: "সেটিংস",

		alwaysShowScore: {
			title: "সবসময় স্কোর দেখান",
			description: "গেম চলাকালীন আপনার বর্তমান স্কোর দেখায়।",
		},

		showScoreWithContrast: {
			title: "রঙের পরিবর্তে কনট্রাস্টের মাধ্যমে স্কোর দেখান",
			description: "লাল, সবুজ এবং নীলের পরিবর্তে ধূসর স্তর ব্যবহার করে।",
		},

		showScoreLegend: {
			title: "স্কোরের লেজেন্ড দেখান",
			description: "গ্রিডের উপরে লেজেন্ড দেখায়।",
		},

		animateDice: {
			title: "পাশা গড়ানোর অ্যানিমেশন",
			description: "3D অ্যানিমেশনের সাথে পাশা গড়ায়।",
		},

		autoRollDice: {
			title: "স্বয়ংক্রিয়ভাবে পাশা ফেলুন",
			notAvailableDuringTheFirstGame: "(প্রথম গেমে উপলব্ধ নয়)",
			description:
				"দুটি প্রতীক গ্রিডে বসানো হলে স্বয়ংক্রিয়ভাবে পাশা ফেলে। এটি দ্বিতীয় প্রতীক বসানো পূর্বাবস্থায় ফেরানোর সুযোগ বাতিল করে দেয়।",
		},

		showDiceMarker: {
			title: "পাশার মার্কার দেখান",
			description: "গ্রিডে কোন প্রতীক বসাতে হবে তা দেখায়।",
		},

		showConfetti: {
			title: "কনফেটি দেখান",
			description:
				"আপনি যখন আপনার সর্বোচ্চ স্কোর ছাড়িয়ে যান তখন একটি কনফেটি বিস্ফোরণ ঘটায়!",
		},

		gridAtBottom: {
			title: "গ্রিডটি স্ক্রিনের নীচে রাখুন",
			description: "মোবাইলে এক হাতে খেলার জন্য উপযোগী।",
		},

		enableWakeLock: {
			title: "খেলার সময় স্ক্রিন চালু রাখুন",
			description:
				"গেম চলাকালীন পাঁচ মিনিট পর্যন্ত আপনার ডিভাইসের স্ক্রিন বন্ধ হওয়া প্রতিরোধ করে। নোট করুন যে কিছু অ্যাপল ডিভাইস এই ফিচারটি সমর্থন করে না।",
		},

		showNavigationAlert: {
			title: "গেম ছেড়ে যাওয়ার আগে নিশ্চিতকরণ চান",
			description:
				"গেম চলাকালীন অন্যত্র যাওয়ার সময় একটি নিশ্চিতকরণ ডায়ালগ দেখায়।",
		},
	},

	siteHeader: {
		detrak: "ডেট্রাক",
	},
};
