import { I18nLocale } from "./en";

export const el: I18nLocale = {
	common: {
		close: "Κλείσιμο",
		symbolNames: {
			bar: "γραμμή",
			cross: "σταυρός",
			tripleBar: "τριπλή γραμμή",
			sharp: "δίεση",
			triangle: "τρίγωνο",
			circle: "κύκλος",
		},
	},

	app: {
		bestScore: "καλύτερο σκορ:",
		endOnGame: "Τέλος! Το σκορ σου είναι",
		endOnGameWithNewScore: "Μπράβο! Νέο υψηλότερο σκορ:",
		numberOfGames_zero: "0 παιχνίδια",
		numberOfGames_one: "1 παιχνίδι",
		numberOfGames_other: "{{count}} παιχνίδια",
		rollDice: "ρίξε το ζάρι",
		rollDice1: {
			part1: "Το σύμβολο που επέλεξες έχει τοποθετηθεί στο πλέγμα παρακάτω.",
			part2: "Τώρα, ρίξε το ζάρι!",
		},
		settingsChangeDice:
			"Τα ζάρια τώρα ρίχνονται αυτόματα χωρίς κίνηση για πιο γρήγορο παιχνίδι. Μπορείς να το αλλάξεις στις ρυθμίσεις.",
		share: {
			shareYourScore: "Μοιράσου το σκορ σου",
			sendScore: "Στείλε το σκορ σου στους φίλους σου!",
			inviteFriends:
				"Και κάλεσέ τους να σε προκαλέσουν στο ίδιο παιχνίδι (τα σύμβολα που θα εμφανιστούν στο παιχνίδι τους θα είναι τα ίδια με τα δικά σου).",
			title: "Detrak",
			text: "🎲 Μόλις έκανα {{count}} στο Detrak! Μπορείς να τα πας καλύτερα; 🤞",
		},
		sr: {
			selectSymbol: "Επίλεξε ένα από τα έξι σύμβολα για να ξεκινήσεις.",
			newDraw: "Νέα κλήρωση:",
			gameFinished: "Το παιχνίδι τελείωσε! Σκορ:",
			gameFinishedNewHighestScore: "Το παιχνίδι τελείωσε! Νέο υψηλότερο σκορ!",
		},
		replayGame: "Ξαναπαίξε αυτό το παιχνίδι",
		startNewGame: "Ξεκίνα νέο παιχνίδι",
		welcome: {
			title: "Καλώς ήρθες στο Detrak!",
			text: "Ξεκίνα επιλέγοντας ένα από τα έξι σύμβολα παραπάνω.",
		},
	},

	detrak: {
		ariaLabel: {
			column: "στήλη",
			empty: "κενό",
			row: "γραμμή",
		},
		clickGrid1: {
			part1:
				"Επίλεξε ένα κενό κελί στο πλέγμα για να τοποθετήσεις το σύμβολο του πρώτου ζαριού.",
			part2: "Ο στόχος είναι να ομαδοποιήσεις τα ίδια σύμβολα μαζί.",
		},
		clickGrid2: {
			part1: "Επίλεξε ένα άλλο κενό κελί για το δεύτερο σύμβολο.",
			part2: "Πρέπει να είναι ακριβώς δίπλα στο πρώτο.",
		},
		rollDice2: {
			left: "Τα σκορ θα εμφανίζονται στη δεξιότερη στήλη και στην κατώτερη γραμμή.",
			legend:
				"Αυτό είναι το υπόμνημα για το σκορ. Για παράδειγμα, πέντε ίδια σύμβολα σε μια γραμμή, στήλη ή διαγώνιο δίνουν 10 πόντους.",
			right: {
				part1:
					"Το σκορ της διαγωνίου εμφανίζεται και στα δύο άκρα, οπότε μετράει δύο φορές!",
				part2: "Ρίξε ξανά τα ζάρια για να συνεχίσεις το παιχνίδι.",
			},
		},
		settingsChangeScore:
			"Επίσης, το σκορ εμφανίζεται πλέον πάντα, ώστε να βλέπεις γρήγορα ποιες γραμμές/στήλες χρειάζονται προσοχή.",
	},

	error: {
		oops: "Ωχ, κάτι πήγε στραβά.",
		error:
			"Παρουσιάστηκε ένα απρόσμενο σφάλμα, παρακαλώ ανανεώστε τη σελίδα. Συγγνώμη για την ενόχληση.",
		googleTranslateNote:
			"Σημείωση: αν χρησιμοποιείς τη λειτουργία μετάφρασης του Google Chrome για να μεταφράσεις αυτή τη σελίδα, τότε αυτή η λειτουργία είναι πιθανώς η αιτία αυτού του σφάλματος.",
		reload: "Ανανέωση",
	},

	headerMenu: {
		openMenu: "Άνοιγμα μενού",
		detrak: "Detrak",
		newFeatures: {
			title: "Διαθέσιμες νέες λειτουργίες!",
			description: "Ολοκλήρωσε το παιχνίδι σου και ανανέωσε την εφαρμογή.",
			action: "Ανανέωση εφαρμογής",
		},
		install: {
			installableWebApp: "Το Detrak είναι μια εγκαταστάσιμη εφαρμογή ιστού!",
			description:
				"Μπορείς να το προσθέσεις στην αρχική σου οθόνη και να παίζεις ακόμα και εκτός σύνδεσης.",
			install: "Εγκατάσταση Detrak",
		},
		gigamicGame:
			"Το Detrak είναι ένα παιχνίδι με πνευματικά δικαιώματα που εκδίδεται από την",
		digitalVersion: {
			madeBy: "Αυτή η ψηφιακή έκδοση έχει δημιουργηθεί από εμένα,",
			webDeveloper:
				", έναν ανεξάρτητο προγραμματιστή ιστού, με την έγκριση της Gigamic. Ευχαριστώ και πάλι, Gigamic!",
		},
		writeToMe: "Ελπίζω να το απολαμβάνεις! Μη διστάσεις να μου γράψεις στο",
		rules: {
			readTheRules: "Διάβασε τους κανόνες",
			rules: "Κανόνες παιχνιδιού",
			part1:
				"Ρίξε τα ζάρια και τοποθέτησε τα σύμβολα που προκύπτουν στο πλέγμα για να σκοράρεις όσο περισσότερους πόντους μπορείς.",
			part2:
				"Κερδίζεις πόντους όταν τοποθετείς ίδια σύμβολα το ένα δίπλα στο άλλο, σε μια γραμμή, στήλη, ή στη διαγώνιο από κάτω αριστερά προς πάνω δεξιά:",
			points: {
				part1: "2 σύμβολα: +2 πόντοι,",
				part2: "3 σύμβολα: +3 πόντοι,",
				part3: "4 σύμβολα: +8 πόντοι,",
				part4: "5 σύμβολα: +10 πόντοι,",
				part5: "κανένα σύμβολο: -5 πόντοι.",
			},
			part3:
				"Τα δύο σύμβολα από τα ζάρια πρέπει να τοποθετηθούν σε γειτονικά ελεύθερα κελιά (οριζόντια ή κάθετα).",
			part4:
				"Είναι αδύνατο να τοποθετήσεις μόνο ένα από τα δύο σύμβολα. Συνεπώς, για να αποφύγεις το πρόωρο τέλος του παιχνιδιού, απόφυγε την απομόνωση κελιών.",
		},
		termsOfUse: "Όροι χρήσης",
		privacyPolicy: "Πολιτική απορρήτου",
		copyright: {
			originalGame: "Αρχικό παιχνίδι",
			digitalVersion: "Ψηφιακή έκδοση",
		},
		sourceCodeAvailableAt: "Ο πηγαίος κώδικας είναι διαθέσιμος στο",
		version: "Έκδοση",
		checkForUpdates: "Έλεγχος για ενημερώσεις",
		updateAvailable:
			"Διαθέσιμη ενημέρωση, ολοκλήρωσε το παιχνίδι σου και κάνε κλικ εδώ για ενημέρωση",
	},

	languageSelector: {
		chooseLanguage: "Επιλογή γλώσσας",
		language: "Γλώσσα",
	},

	navigationBlocker: {
		title: "Αυτό θα σταματήσει το τρέχον παιχνίδι, είσαι σίγουρος/η;",
		description:
			"Παρακαλώ επιβεβαίωσε ότι θέλεις να σταματήσεις το τρέχον παιχνίδι.",
		confirmationCheckbox:
			"Να ζητείται πάντα επιβεβαίωση πριν τη διακοπή ενός παιχνιδιού",
		keepPlaying: "Συνέχεια παιχνιδιού",
		stopGame: "Σταμάτημα παιχνιδιού",
	},

	newGameDialog: {
		close: "Κλείσιμο",
		createGame: "Δημιουργία παιχνιδιού",
		joinGame: "Συμμετοχή σε παιχνίδι",
		pickAnotherDay: "Επίλεξε άλλη μέρα",
		play: "Παίξε",
		playRandomGame: "Παίξε ένα τυχαίο παιχνίδι",
		playTodayGame: "Παίξε το σημερινό παιχνίδι",
		playWithFriends: "Παίξε με φίλους",
		shareCreate: {
			scanQrCode:
				"Ζήτα από τους φίλους σου να σκανάρουν αυτόν τον κωδικό QR, ή μοιράσου το σύνδεσμο μαζί τους.",
			clickPlay: "Μετά κάνε κλικ στο Παίξε.",
			title: "Detrak",
			joinMe: "🎲 Έλα να παίξουμε μαζί Detrak!",
			shareLink: "Κοινοποίηση συνδέσμου",
			copyLink: "Αντιγραφή συνδέσμου στο πρόχειρο",
		},
		shareJoin: {
			useCamera:
				"Χρησιμοποίησε την κάμερα της συσκευής σου για να σκανάρεις τον κωδικό QR ενός παιχνιδιού.",
			openGameLink: "Ή, άνοιξε το σύνδεσμο ενός παιχνιδιού.",
			enterGameLink:
				"Ή, εισήγαγε το σύνδεσμο ενός παιχνιδιού παρακάτω και κάνε κλικ στο Παίξε.",
		},
		stopGame: "Σταμάτημα παιχνιδιού",
		title: {
			createGame: "Δημιουργία παιχνιδιού",
			inviteToGame: "Πρόσκληση ατόμων στο τρέχον παιχνίδι",
			joinGame: "Συμμετοχή σε παιχνίδι",
			newGame: "Νέο παιχνίδι",
			playWithFriends: "Παίξε με φίλους",
			welcomeToNewVersion: "Καλώς ήρθες στη νέα έκδοση του Detrak!",
		},
		welcome: {
			intro: "Υπάρχουν δύο νέοι τρόποι παιχνιδιού:",
			dailyGame: "Το ημερήσιο παιχνίδι",
			dailyGameDetails:
				"κάθε μέρα, η ακολουθία των συμβόλων που ρίχνουν τα ζάρια είναι η ίδια για όλους.",
			playWithFriends: "Παίξε με φίλους",
			playWithFriendsDetails:
				"δημιούργησε ένα παιχνίδι και κάλεσε άτομα να συμμετάσχουν. Και εδώ, η ακολουθία των συμβόλων κατά τη διάρκεια του παιχνιδιού είναι η ίδια για εσένα και τους φίλους σου. Λειτουργεί ακόμα και χωρίς σύνδεση στο διαδίκτυο!",
			startPlaying: "Ξεκίνα να παίζεις!",
		},
		or: "ή",
	},

	themeSelector: {
		chooseTheme: "Επιλογή θέματος",
		theme: "Θέμα",
		sameAsDevice: "Ίδιο με τη συσκευή",
		light: "Φωτεινό",
		dark: "Σκοτεινό",
	},

	settingsDialog: {
		openSettingsDialog: "Άνοιγμα ρυθμίσεων",
		settings: "Ρυθμίσεις",

		alwaysShowScore: {
			title: "Εμφάνιση σκορ πάντα",
			description:
				"Εμφανίζει το τρέχον σκορ σου κατά τη διάρκεια του παιχνιδιού.",
		},

		showScoreWithContrast: {
			title: "Εμφάνιση σκορ με αντίθεση αντί για χρώμα",
			description:
				"Χρησιμοποιεί επίπεδα του γκρι αντί για κόκκινο, πράσινο και μπλε.",
		},

		showScoreLegend: {
			title: "Εμφάνιση υπομνήματος σκορ",
			description: "Εμφανίζει το υπόμνημα πάνω από το πλέγμα.",
		},

		animateDice: {
			title: "Κίνηση στα ζάρια",
			description: "Ρίχνει τα ζάρια με 3D κίνηση.",
		},

		autoRollDice: {
			title: "Αυτόματο ρίξιμο ζαριών",
			notAvailableDuringTheFirstGame:
				"(δεν είναι διαθέσιμο κατά το πρώτο παιχνίδι)",
			description:
				"Ρίχνει τα ζάρια αυτόματα μόλις τοποθετηθούν τα δύο σύμβολα στο πλέγμα. Αυτό αφαιρεί τη δυνατότητα αναίρεσης της τοποθέτησης του δεύτερου συμβόλου.",
		},

		showDiceMarker: {
			title: "Εμφάνιση δείκτη ζαριού",
			description: "Δείχνει ποιο σύμβολο πρέπει να τοποθετηθεί στο πλέγμα.",
		},

		showConfetti: {
			title: "Εμφάνιση κομφετί",
			description:
				"Ρίχνει μια έκρηξη κομφετί όταν ξεπερνάς το υψηλότερο σκορ σου!",
		},

		gridAtBottom: {
			title: "Τοποθέτηση πλέγματος στο κάτω μέρος της οθόνης",
			description: "Χρήσιμο για παιχνίδι με ένα χέρι σε κινητές συσκευές.",
		},

		enableWakeLock: {
			title: "Διατήρηση οθόνης ανοιχτής κατά το παιχνίδι",
			description:
				"Εμποδίζει την οθόνη της συσκευής σου να σβήσει για πέντε λεπτά, ενώ παίζεται ένα παιχνίδι. Σημείωση: κάποιες συσκευές Apple δεν υποστηρίζουν αυτή τη λειτουργία.",
		},

		showNavigationAlert: {
			title: "Ζήτηση επιβεβαίωσης πριν την έξοδο από το παιχνίδι",
			description:
				"Εμφανίζει ένα παράθυρο επιβεβαίωσης όταν πλοηγείσαι αλλού κατά τη διάρκεια ενός παιχνιδιού.",
		},
	},

	siteHeader: {
		detrak: "Detrak",
	},
};
