import { I18nLocale } from "./en";

export const hi: I18nLocale = {
	common: {
		close: "बंद करें",
		symbolNames: {
			bar: "वर्टिकल बार",
			cross: "क्रॉस",
			tripleBar: "तीन वर्टिकल बार",
			sharp: "शार्प",
			triangle: "त्रिकोण",
			circle: "वृत्त",
		},
	},

	app: {
		bestScore: "सर्वोत्तम स्कोर:",
		endOnGame: "समाप्त! आपका स्कोर है",
		endOnGameWithNewScore: "बहुत बढ़िया! नया उच्चतम स्कोर:",
		numberOfGames_one: "{{count}} गेम",
		numberOfGames_other: "{{count}} गेम्स",
		rollDice: "पासा फेंकें",
		rollDice1: {
			part1:
				"आपके द्वारा चुना गया प्रतीक नीचे दिए गए बोर्ड में डाल दिया गया है।",
			part2: "अब, पासा फेंकें!",
		},
		settingsChangeDice:
			"पासे अब बिना एनीमेशन के हैं और तेज़ी से खेलने के लिए स्वचालित रूप से फेंके जाते हैं। आप इसे सेटिंग्स में बदल सकते हैं।",
		share: {
			shareYourScore: "अपना स्कोर साझा करें",
			sendScore: "अपना स्कोर अपने दोस्तों को भेजें!",
			inviteFriends:
				"और उन्हें उसी गेम पर आपको चुनौती देने के लिए आमंत्रित करें (उनके गेम के दौरान निकाले गए प्रतीक आपके जैसे ही होंगे)।",
			title: "Detrak",
			text: "🎲 अभी Detrak पर {{count}} स्कोर किया! क्या आप बेहतर कर सकते हैं? 🤞",
		},
		sr: {
			selectSymbol: "शुरू करने के लिए छह प्रतीकों में से एक चुनें।",
			newDraw: "नया ड्रॉ:",
			gameFinished: "गेम समाप्त! स्कोर:",
			gameFinishedNewHighestScore: "गेम समाप्त! नया उच्चतम स्कोर!",
		},
		replayGame: "इस गेम को फिर से खेलें",
		startNewGame: "नया गेम शुरू करें",
		welcome: {
			title: "Detrak में आपका स्वागत है!",
			text: "ऊपर दिए गए छह प्रतीकों में से एक चुनकर शुरू करें।",
		},
	},

	detrak: {
		ariaLabel: {
			column: "कॉलम",
			empty: "खाली",
			row: "पंक्ति",
		},
		clickGrid1: {
			part1:
				"पहले पासे के प्रतीक को डालने के लिए बोर्ड में कोई खाली सेल चुनें।",
			part2: "लक्ष्य समान प्रतीकों को एक साथ समूहित करना है।",
		},
		clickGrid2: {
			part1: "दूसरे प्रतीक के लिए कोई और खाली सेल चुनें।",
			part2: "यह पहले वाले के बिल्कुल बगल में होना चाहिए।",
		},
		rollDice2: {
			left: "स्कोर सबसे दाएं कॉलम और सबसे नीचे की पंक्ति में दिखाए जाएंगे।",
			legend:
				"यह स्कोर की लेजेंड है। उदाहरण के लिए, एक पंक्ति, कॉलम या विकर्ण पर पांच समान प्रतीक 10 अंक देते हैं।",
			right: {
				part1:
					"विकर्ण का स्कोर दोनों छोरों पर दिखता है, इसलिए इसे दो बार गिना जाता है!",
				part2: "गेम जारी रखने के लिए पासा फिर से फेंकें।",
			},
		},
		settingsChangeScore:
			"साथ ही, स्कोर अब हमेशा दिखाया जाता है, ताकि आप जल्दी देख सकें कि किन पंक्तियों/कॉलमों पर ध्यान देने की आवश्यकता है।",
	},

	error: {
		oops: "अरे, कुछ गलत हुआ।",
		error:
			"एक अप्रत्याशित त्रुटि हुई, कृपया पेज को रीलोड करें। असुविधा के लिए खुशी।",
		googleTranslateNote:
			"नोट: यदि आप इस पेज को अनुवाद करने के लिए Google Chrome की अनुवाद सुविधा का उपयोग कर रहे हैं, तो यह सुविधा संभवतः इस त्रुटि का कारण है।",
		reload: "रीलोड",
	},

	headerMenu: {
		openMenu: "मेन्यू खोलें",
		detrak: "Detrak",
		newFeatures: {
			title: "नई सुविधाएं उपलब्ध हैं!",
			description: "अपना गेम समाप्त करें और ऐप को रीलोड करें।",
			action: "ऐप रीलोड करें",
		},
		install: {
			installableWebApp: "Detrak एक इंस्टॉल करने योग्य वेब ऐप है!",
			description:
				"आप इसे अपनी होम स्क्रीन पर जोड़ सकते हैं और ऑफलाइन भी खेल सकते हैं।",
			install: "Detrak इंस्टॉल करें",
		},
		gigamicGame: "Detrak एक कॉपीराइटेड गेम है जो प्रकाशित किया गया है",
		digitalVersion: {
			madeBy: "यह डिजिटल संस्करण मेरे द्वारा बनाया गया है,",
			webDeveloper:
				", एक स्वतंत्र वेब डेवलपर, Gigamic की अनुमति से। धन्यवाद फिर से, Gigamic!",
		},
		writeToMe:
			"मुझे उम्मीद है कि आप इसका आनंद ले रहे हैं! कृपया मुझे लिखने में संकोच न करें",
		rules: {
			readTheRules: "नियम पढ़ें",
			rules: "गेम के नियम",
			part1:
				"पासा फेंकें और प्राप्त प्रतीकों को बोर्ड में रखें ताकि अधिकतम अंक प्राप्त कर सकें।",
			part2:
				"जब आप समान प्रतीकों को एक-दूसरे के बगल में रखते हैं तो आपको अंक मिलते हैं, एक पंक्ति, कॉलम या बाएं-नीचे से दाएं-ऊपर के विकर्ण में:",
			points: {
				part1: "2 प्रतीक: +2 अंक,",
				part2: "3 प्रतीक: +3 अंक,",
				part3: "4 प्रतीक: +8 अंक,",
				part4: "5 प्रतीक: +10 अंक,",
				part5: "कोई प्रतीक नहीं: -5 अंक।",
			},
			part3:
				"पासों के दो प्रतीकों को आसन्न खाली सेल्स में रखा जाना चाहिए (क्षैतिज या लंबवत)।",
			part4:
				"केवल दो में से एक प्रतीक रखना असंभव है। इसलिए, गेम के समय से पहले समाप्त होने से रोकने के लिए, सेल्स को अलग-थलग करने से बचें।",
		},
		termsOfUse: "उपयोग की शर्तें",
		privacyPolicy: "गोपनीयता नीति",
		copyright: {
			originalGame: "मूल गेम",
			digitalVersion: "डिजिटल संस्करण",
		},
		sourceCodeAvailableAt: "सोर्स कोड उपलब्ध है",
		version: "संस्करण",
		checkForUpdates: "अपडेट जांचें",
		updateAvailable:
			"अपडेट उपलब्ध है, अपना गेम समाप्त करें और अपडेट करने के लिए यहां क्लिक करें",
	},

	languageSelector: {
		chooseLanguage: "भाषा चुनें",
		language: "भाषा",
		changeLanguageOffline:
			"अनुवाद लोड करने में असमर्थ: आपका डिवाइस ऑफ़लाइन प्रतीत होता है। कृपया सुनिश्चित करें कि आपके डिवाइस में इंटरनेट एक्सेस है और पुनः प्रयास करें।",
		changeLanguageError:
			"नई भाषा सेट करते समय एक त्रुटि हुई। कृपया ऐप को पुनः प्रारंभ करें और फिर से प्रयास करें।",
	},

	navigationBlocker: {
		title: "इससे वर्तमान गेम रुक जाएगा, क्या आप निश्चित हैं?",
		description: "कृपया पुष्टि करें कि आप वर्तमान गेम को रोकना चाहते हैं।",
		confirmationCheckbox: "गेम को बाधित करने से पहले हमेशा पुष्टि मांगें",
		keepPlaying: "खेलते रहें",
		stopGame: "इस गेम को रोकें",
	},

	newGameDialog: {
		close: "बंद करें",
		createGame: "गेम बनाएं",
		joinGame: "गेम में शामिल हों",
		pickAnotherDay: "कोई और दिन चुनें",
		play: "खेलें",
		playRandomGame: "रैंडम गेम खेलें",
		playTodayGame: "आज का गेम खेलें",
		playWithFriends: "दोस्तों के साथ खेलें",
		shareCreate: {
			scanQrCode:
				"अपने दोस्तों से इस QR कोड को स्कैन करने को कहें, या उनके साथ लिंक साझा करें।",
			clickPlay: "फिर खेलें पर क्लिक करें।",
			title: "Detrak",
			joinMe: "🎲 Detrak के इस गेम के लिए मेरे साथ जुड़ें!",
			shareLink: "लिंक साझा करें",
			copyLink: "लिंक को क्लिपबोर्ड पर कॉपी करें",
		},
		shareJoin: {
			useCamera:
				"गेम का QR कोड स्कैन करने के लिए अपने डिवाइस के कैमरा का उपयोग करें।",
			openGameLink: "या, गेम का लिंक खोलें।",
			enterGameLink: "या, नीचे गेम का लिंक डालें और खेलें पर क्लिक करें।",
		},
		stopGame: "इस गेम को रोकें",
		title: {
			createGame: "गेम बनाएं",
			inviteToGame: "वर्तमान गेम में लोगों को आमंत्रित करें",
			joinGame: "गेम में शामिल हों",
			newGame: "नया गेम",
			playWithFriends: "दोस्तों के साथ खेलें",
			welcomeToNewVersion: "Detrak के नए संस्करण में आपका स्वागत है!",
		},
		welcome: {
			intro: "खेलने के दो नए तरीके हैं:",
			dailyGame: "दैनिक गेम",
			dailyGameDetails:
				"हर दिन, पासों द्वारा निकाले गए प्रतीकों का क्रम सभी के लिए समान होता है।",
			playWithFriends: "दोस्तों के साथ खेलें",
			playWithFriendsDetails:
				"एक गेम बनाएं और लोगों को शामिल होने के लिए आमंत्रित करें। यहां भी, गेम के दौरान निकाले गए प्रतीकों का क्रम आपके और आपके दोस्तों के लिए समान होता है। यह इंटरनेट कनेक्शन के बिना भी काम करता है!",
			startPlaying: "खेलना शुरू करें!",
		},
		or: "या",
	},

	themeSelector: {
		chooseTheme: "थीम चुनें",
		theme: "थीम",
		sameAsDevice: "डिवाइस के समान",
		light: "लाइट",
		dark: "डार्क",
	},

	settingsDialog: {
		openSettingsDialog: "सेटिंग्स डायलॉग खोलें",
		settings: "सेटिंग्स",

		alwaysShowScore: {
			title: "हमेशा स्कोर दिखाएं",
			description: "गेम के दौरान आपका वर्तमान स्कोर दिखाता है।",
		},

		showScoreWithContrast: {
			title: "रंग के बजाय कंट्रास्ट के साथ स्कोर दिखाएं",
			description:
				"लाल, हरे और नीले के बजाय स्लेटी रंग के स्तर का उपयोग करता है।",
		},

		showScoreLegend: {
			title: "स्कोर की लेजेंड दिखाएं",
			description: "बोर्ड के ऊपर रखी गई लेजेंड दिखाता है।",
		},

		animateDice: {
			title: "पासा फेंकने को एनीमेट करें",
			description: "3D एनीमेशन के साथ पासा फेंकता है।",
		},

		autoRollDice: {
			title: "स्वचालित रूप से पासा फेंकें",
			notAvailableDuringTheFirstGame: "(पहले गेम के दौरान उपलब्ध नहीं)",
			description:
				"बोर्ड में दो प्रतीक रखे जाने के बाद स्वचालित रूप से पासा फेंकता है। इससे दूसरे प्रतीक की प्लेसमेंट को अंडू करने की क्षमता हट जाती है।",
		},

		showDiceMarker: {
			title: "पासा मार्कर दिखाएं",
			description: "दिखाता है कि बोर्ड पर कौन सा प्रतीक रखा जाना है।",
		},

		showConfetti: {
			title: "कंफेटी दिखाएं",
			description:
				"जब आप अपना उच्चतम स्कोर हराते हैं तो कंफेटी का विस्फोट होता है!",
		},

		gridAtBottom: {
			title: "बोर्ड को स्क्रीन के नीचे रखें",
			description: "मोबाइल पर एक हाथ से खेलने के लिए उपयोगी।",
		},

		enableWakeLock: {
			title: "खेलते समय स्क्रीन को चालू रखें",
			description:
				"गेम खेले जाने के दौरान आपके डिवाइस की स्क्रीन को पांच मिनट तक बंद होने से रोकता है। नोट करें कि कुछ Apple डिवाइसेस में यह सुविधा समर्थित नहीं है।",
		},

		showNavigationAlert: {
			title: "गेम छोड़ने से पहले पुष्टि मांगें",
			description: "गेम के दौरान पेज छोड़ते समय पुष्टि डायलॉग दिखाता है।",
		},
	},

	siteHeader: {
		detrak: "Detrak",
	},
};
