import { I18nLocale } from "./en";

export const th: I18nLocale = {
	common: {
		close: "ปิด",
		symbolNames: {
			bar: "เส้น",
			cross: "กากบาท",
			tripleBar: "เส้นสาม",
			sharp: "เหลี่ยม",
			triangle: "สามเหลี่ยม",
			circle: "วงกลม",
		},
	},

	app: {
		bestScore: "คะแนนสูงสุด:",
		endOnGame: "จบแล้ว! คะแนนของคุณคือ",
		endOnGameWithNewScore: "เยี่ยมเลย! คะแนนสูงสุดใหม่:",
		numberOfGames_other: "{{count}} เกม",
		rollDice: "ทอยลูกเต๋า",
		rollDice1: {
			part1: "สัญลักษณ์ที่คุณเลือกได้ถูกใส่ในตารางด้านล่างแล้ว",
			part2: "ตอนนี้ทอยลูกเต๋า!",
		},
		settingsChangeDice:
			"ลูกเต๋าจะไม่มีแอนิเมชันและจะทอยอัตโนมัติเพื่อให้คุณเล่นได้เร็วขึ้น คุณสามารถเปลี่ยนแปลงได้ในการตั้งค่า",
		share: {
			shareYourScore: "แชร์คะแนนของคุณ",
			sendScore: "ส่งคะแนนของคุณให้เพื่อน!",
			inviteFriends:
				"และเชิญพวกเขาให้ท้าทายคุณในเกมเดียวกัน (สัญลักษณ์ที่ได้ในเกมของพวกเขาจะเหมือนกับของคุณ)",
			title: "Detrak",
			text: "🎲 เพิ่งได้ {{count}} ใน Detrak! คุณทำได้ดีกว่านี้ไหม? 🤞",
		},
		sr: {
			selectSymbol: "เลือกหนึ่งในหกสัญลักษณ์เพื่อเริ่มต้น",
			newDraw: "การจั่วใหม่:",
			gameFinished: "เกมจบแล้ว! คะแนน:",
			gameFinishedNewHighestScore: "เกมจบแล้ว! คะแนนสูงสุดใหม่!",
		},
		replayGame: "เล่นเกมนี้อีกครั้ง",
		startNewGame: "เริ่มเกมใหม่",
		welcome: {
			title: "ยินดีต้อนรับสู่ Detrak!",
			text: "เริ่มต้นด้วยการเลือกหนึ่งในหกสัญลักษณ์ด้านบน",
		},
	},

	detrak: {
		ariaLabel: {
			column: "คอลัมน์",
			empty: "ว่าง",
			row: "แถว",
		},
		clickGrid1: {
			part1: "เลือกช่องว่างในตารางเพื่อใส่สัญลักษณ์จากลูกเต๋าลูกแรก",
			part2: "เป้าหมายคือการจัดกลุ่มสัญลักษณ์เดียวกันให้อยู่ด้วยกัน",
		},
		clickGrid2: {
			part1: "เลือกช่องว่างอื่นสำหรับสัญลักษณ์ที่สอง",
			part2: "มันต้องติดกับช่องแรกโดยตรง",
		},
		rollDice2: {
			left: "คะแนนจะแสดงในคอลัมน์ขวาสุดและแถวล่างสุด",
			legend:
				"นี่คือคำอธิบายสำหรับคะแนน ตัวอย่างเช่น สัญลักษณ์เดียวกันห้าอันในแถว คอลัมน์ หรือเส้นทแยงมุม จะได้ 10 คะแนน",
			right: {
				part1:
					"คะแนนของเส้นทแยงมุมจะปรากฏที่ปลายทั้งสองข้าง ดังนั้นจึงนับสองครั้ง!",
				part2: "ทอยลูกเต๋าอีกครั้งเพื่อเล่นต่อ",
			},
		},
		settingsChangeScore:
			"นอกจากนี้ คะแนนจะแสดงอยู่เสมอ เพื่อให้คุณเห็นได้อย่างรวดเร็วว่าแถว/คอลัมน์ไหนต้องการความสนใจ",
	},

	error: {
		oops: "อุ๊ปส์ มีบางอย่างผิดพลาด",
		error: "เกิดข้อผิดพลาดที่ไม่คาดคิด กรุณาโหลดหน้าใหม่ ขออภัยในความไม่สะดวก",
		googleTranslateNote:
			"หมายเหตุ: หากคุณใช้ฟีเจอร์แปลภาษาของ Google Chrome เพื่อแปลหน้านี้ ฟีเจอร์นี้อาจเป็นสาเหตุของข้อผิดพลาดนี้",
		reload: "โหลดใหม่",
	},

	headerMenu: {
		openMenu: "เปิดเมนู",
		detrak: "Detrak",
		newFeatures: {
			title: "มีฟีเจอร์ใหม่!",
			description: "จบเกมและโหลดแอปใหม่",
			action: "โหลดแอปใหม่",
		},
		install: {
			installableWebApp: "Detrak เป็นเว็บแอปที่ติดตั้งได้!",
			description: "คุณสามารถเพิ่มไปยังหน้าจอหลักและเล่นแม้ในขณะออฟไลน์",
			install: "ติดตั้ง Detrak",
		},
		gigamicGame: "Detrak เป็นเกมที่มีลิขสิทธิ์เผยแพร่โดย",
		digitalVersion: {
			madeBy: "เวอร์ชันดิจิทัลนี้สร้างโดยผม",
			webDeveloper:
				" นักพัฒนาเว็บอิสระ ด้วยการอนุมัติจาก Gigamic ขอบคุณอีกครั้ง Gigamic!",
		},
		writeToMe: "หวังว่าคุณจะสนุกกับมัน! เขียนหาผมได้ที่",
		rules: {
			readTheRules: "อ่านกฎกติกา",
			rules: "กฎกติกาเกม",
			part1: "ทอยลูกเต๋าและวางสัญลักษณ์ที่ได้ในตารางเพื่อให้ได้คะแนนมากที่สุด",
			part2:
				"คุณจะได้คะแนนเมื่อวางสัญลักษณ์เดียวกันติดกัน ในแถว คอลัมน์ หรือเส้นทแยงมุมจากซ้ายล่างไปขวาบน:",
			points: {
				part1: "2 สัญลักษณ์: +2 คะแนน",
				part2: "3 สัญลักษณ์: +3 คะแนน",
				part3: "4 สัญลักษณ์: +8 คะแนน",
				part4: "5 สัญลักษณ์: +10 คะแนน",
				part5: "ไม่มีสัญลักษณ์: -5 คะแนน",
			},
			part3:
				"สัญลักษณ์สองอันจากลูกเต๋าต้องวางในช่องว่างที่อยู่ติดกัน (แนวนอนหรือแนวตั้ง)",
			part4:
				"ไม่สามารถวางเพียงหนึ่งในสองสัญลักษณ์ได้ ดังนั้นเพื่อป้องกันไม่ให้เกมจบก่อนเวลา ให้หลีกเลี่ยงการแยกช่อง",
		},
		termsOfUse: "ข้อกำหนดการใช้งาน",
		privacyPolicy: "นโยบายความเป็นส่วนตัว",
		copyright: {
			originalGame: "เกมต้นฉบับ",
			digitalVersion: "เวอร์ชันดิจิทัล",
		},
		sourceCodeAvailableAt: "ซอร์สโค้ดมีให้ที่",
		version: "เวอร์ชัน",
		checkForUpdates: "ตรวจสอบการอัปเดต",
		updateAvailable: "มีการอัปเดต จบเกมและคลิกที่นี่เพื่ออัปเดต",
	},

	languageSelector: {
		chooseLanguage: "เลือกภาษา",
		language: "ภาษา",
		changeLanguageOffline:
			"ไม่สามารถโหลดการแปลได้: อุปกรณ์ของคุณดูเหมือนจะออฟไลน์ กรุณาตรวจสอบว่าอุปกรณ์ของคุณมีการเชื่อมต่ออินเทอร์เน็ตและลองอีกครั้ง",
		changeLanguageError:
			"เกิดข้อผิดพลาดในการตั้งค่าภาษาใหม่ กรุณาเริ่มแอปใหม่และลองอีกครั้ง",
	},

	navigationBlocker: {
		title: "นี่จะหยุดเกมปัจจุบัน คุณแน่ใจไหม?",
		description: "กรุณายืนยันว่าคุณต้องการหยุดเกมปัจจุบัน",
		confirmationCheckbox: "ถามการยืนยันเสมอก่อนขัดจังหวะเกม",
		keepPlaying: "เล่นต่อ",
		stopGame: "หยุดเกมนี้",
	},

	newGameDialog: {
		close: "ปิด",
		createGame: "สร้างเกม",
		joinGame: "เข้าร่วมเกม",
		pickAnotherDay: "เลือกวันอื่น",
		play: "เล่น",
		playRandomGame: "เล่นเกมแบบสุ่ม",
		playTodayGame: "เล่นเกมวันนี้",
		playWithFriends: "เล่นกับเพื่อน",
		shareCreate: {
			scanQrCode: "ขอให้เพื่อนของคุณสแกน QR โค้ดนี้ หรือแชร์ลิงก์ให้พวกเขา",
			clickPlay: "จากนั้นคลิกเล่น",
			title: "Detrak",
			joinMe: "🎲 มาเล่น Detrak กับผม!",
			shareLink: "แชร์ลิงก์",
			copyLink: "คัดลอกลิงก์ไปยังคลิปบอร์ด",
		},
		shareJoin: {
			useCamera: "ใช้กล้องของอุปกรณ์เพื่อสแกน QR โค้ดของเกม",
			openGameLink: "หรือเปิดลิงก์เกม",
			enterGameLink: "หรือป้อนลิงก์เกมด้านล่างและคลิกเล่น",
		},
		stopGame: "หยุดเกมนี้",
		title: {
			createGame: "สร้างเกม",
			inviteToGame: "เชิญคนเข้าร่วมเกมปัจจุบัน",
			joinGame: "เข้าร่วมเกม",
			newGame: "เกมใหม่",
			playWithFriends: "เล่นกับเพื่อน",
			welcomeToNewVersion: "ยินดีต้อนรับสู่ Detrak เวอร์ชันใหม่!",
		},
		welcome: {
			intro: "มีวิธีเล่นใหม่สองแบบ:",
			dailyGame: "เกมรายวัน",
			dailyGameDetails:
				"ทุกวัน ลำดับของสัญลักษณ์ที่ทอยจากลูกเต๋าจะเหมือนกันสำหรับทุกคน",
			playWithFriends: "เล่นกับเพื่อน",
			playWithFriendsDetails:
				"สร้างเกมและเชิญคนเข้าร่วม ที่นี่ด้วย ลำดับของสัญลักษณ์ที่ทอยในระหว่างเกมจะเหมือนกันสำหรับเพื่อนและคุณ ใช้งานได้แม้ไม่มีอินเทอร์เน็ต!",
			startPlaying: "เริ่มเล่น!",
		},
		or: "หรือ",
	},

	themeSelector: {
		chooseTheme: "เลือกธีม",
		theme: "ธีม",
		sameAsDevice: "เหมือนอุปกรณ์",
		light: "สว่าง",
		dark: "มืด",
	},

	settingsDialog: {
		openSettingsDialog: "เปิดกล่องโต้ตอบการตั้งค่า",
		settings: "การตั้งค่า",

		alwaysShowScore: {
			title: "แสดงคะแนนเสมอ",
			description: "แสดงคะแนนปัจจุบันของคุณระหว่างเกม",
		},

		showScoreWithContrast: {
			title: "แสดงคะแนนด้วยความคมชัดแทนสี",
			description: "ใช้ระดับสีเทาแทนสีแดง เขียว และน้ำเงิน",
		},

		showScoreLegend: {
			title: "แสดงคำอธิบายคะแนน",
			description: "แสดงคำอธิบายที่วางไว้เหนือตาราง",
		},

		animateDice: {
			title: "แอนิเมชันการทอยลูกเต๋า",
			description: "ทอยลูกเต๋าด้วยแอนิเมชัน 3D",
		},

		autoRollDice: {
			title: "ทอยลูกเต๋าอัตโนมัติ",
			notAvailableDuringTheFirstGame: "(ไม่พร้อมใช้งานในเกมแรก)",
			description:
				"ทอยลูกเต๋าอัตโนมัติเมื่อสัญลักษณ์สองอันถูกวางในตาราง นี่จะลบความสามารถในการเลิกทำการวางสัญลักษณ์ที่สอง",
		},

		showDiceMarker: {
			title: "แสดงเครื่องหมายลูกเต๋า",
			description: "แสดงว่าสัญลักษณ์ใดที่จะต้องวางในตาราง",
		},

		showConfetti: {
			title: "แสดงขี้เลื่อย",
			description: "โยนขี้เลื่อยระเบิดเมื่อคุณทำลายคะแนนสูงสุด!",
		},

		gridAtBottom: {
			title: "วางตารางที่ด้านล่างของหน้าจอ",
			description: "มีประโยชน์สำหรับการเล่นด้วยมือเดียวบนมือถือ",
		},

		enableWakeLock: {
			title: "เปิดหน้าจอไว้ขณะเล่น",
			description:
				"ป้องกันไม่ให้หน้าจออุปกรณ์ปิดเป็นเวลาห้านาทีขณะเล่นเกม โปรดทราบว่าอุปกรณ์ Apple บางรุ่นไม่รองรับฟีเจอร์นี้",
		},

		showNavigationAlert: {
			title: "ขอการยืนยันก่อนออกจากเกม",
			description: "แสดงกล่องโต้ตอบยืนยันเมื่อออกไประหว่างเกม",
		},
	},

	siteHeader: {
		detrak: "Detrak",
	},
};
