import { I18nLocale } from "./en";

export const uk: I18nLocale = {
	common: {
		close: "Закрити",
		symbolNames: {
			bar: "паличка",
			cross: "хрестик",
			tripleBar: "потрійна паличка",
			sharp: "дієз",
			triangle: "трикутник",
			circle: "коло",
		},
	},

	app: {
		bestScore: "найкращий результат:",
		endOnGame: "Завершено! Ваш результат:",
		endOnGameWithNewScore: "Чудово! Новий рекорд:",
		numberOfGames_one: "{{count}} гра",
		numberOfGames_few: "{{count}} гри",
		numberOfGames_many: "{{count}} ігор",
		numberOfGames_other: "{{count}} ігор",
		rollDice: "кинути кості",
		rollDice1: {
			part1: "Обраний вами символ було поміщено в сітку нижче.",
			part2: "Тепер киньте кості!",
		},
		settingsChangeDice:
			"Кості тепер не анімовані та кидаються автоматично, щоб ви могли грати швидше. Ви можете змінити це в налаштуваннях.",
		share: {
			shareYourScore: "Поділитися результатом",
			sendScore: "Надішліть свій результат друзям!",
			inviteFriends:
				"І запросіть їх змагатися з вами в тій же грі (символи, що випадуть під час їхньої гри, будуть такими ж, як ваші).",
			title: "Detrak",
			text: "🎲 Щойно набрав {{count}} у Detrak! Зможеш краще? 🤞",
		},
		sr: {
			selectSymbol: "Оберіть один із шести символів для початку.",
			newDraw: "Новий кидок:",
			gameFinished: "Гру завершено! Результат:",
			gameFinishedNewHighestScore: "Гру завершено! Новий рекорд!",
		},
		replayGame: "Переграти цю гру",
		startNewGame: "Почати нову гру",
		welcome: {
			title: "Ласкаво просимо до Detrak!",
			text: "Почніть з вибору одного з шести символів вище.",
		},
	},

	detrak: {
		ariaLabel: {
			column: "стовпець",
			empty: "порожньо",
			row: "рядок",
		},
		clickGrid1: {
			part1:
				"Оберіть порожню клітинку в сітці, щоб помістити символ з першого кубика.",
			part2: "Мета — групувати однакові символи разом.",
		},
		clickGrid2: {
			part1: "Оберіть іншу порожню клітинку для другого символу.",
			part2: "Вона повинна знаходитися безпосередньо поруч з першою.",
		},
		rollDice2: {
			left: "Очки відображатимуться в крайньому правому стовпці та нижньому рядку.",
			legend:
				"Це легенда для підрахунку очок. Наприклад, п'ять однакових символів у ряду, стовпці або по діагоналі дають 10 очок.",
			right: {
				part1:
					"Очки діагоналі з'являються на обох кінцях, тому вони рахуються двічі!",
				part2: "Киньте кості знову, щоб продовжити гру.",
			},
		},
		settingsChangeScore:
			"Також тепер очки завжди відображаються, щоб ви могли швидко бачити, які рядки/стовпці потребують уваги.",
	},

	error: {
		oops: "Ой, щось пішло не так.",
		error:
			"Сталася неочікувана помилка, будь ласка, перезавантажте сторінку. Вибачте за незручності.",
		googleTranslateNote:
			"Примітка: якщо ви використовуєте функцію перекладу Google Chrome для перекладу цієї сторінки, то ця функція, ймовірно, є причиною цієї помилки.",
		reload: "Перезавантажити",
	},

	headerMenu: {
		openMenu: "Відкрити меню",
		detrak: "Detrak",
		newFeatures: {
			title: "Доступні нові функції!",
			description: "Завершіть гру та перезавантажте додаток.",
			action: "Перезавантажити додаток",
		},
		install: {
			installableWebApp: "Detrak — це встановлюваний веб-додаток!",
			description:
				"Ви можете додати його на головний екран і грати навіть офлайн.",
			install: "Встановити Detrak",
		},
		gigamicGame: "Detrak — гра, захищена авторським правом, опублікована",
		digitalVersion: {
			madeBy: "Ця цифрова версія була створена мною,",
			webDeveloper:
				", незалежним веб-розробником, із схваленням Gigamic. Дякую ще раз, Gigamic!",
		},
		writeToMe: "Сподіваюся, вам подобається! Не соромтеся писати мені на",
		rules: {
			readTheRules: "Прочитати правила",
			rules: "Правила гри",
			part1:
				"Кидайте кості та розміщуйте отримані символи в сітці, щоб набрати якомога більше очок.",
			part2:
				"Ви отримуєте очки, коли розміщуєте однакові символи поруч один з одним у ряду, стовпці або по діагоналі знизу зліва направо вгору:",
			points: {
				part1: "2 символи: +2 очки,",
				part2: "3 символи: +3 очки,",
				part3: "4 символи: +8 очок,",
				part4: "5 символів: +10 очок,",
				part5: "немає символів: -5 очок.",
			},
			part3:
				"Два символи з кісток повинні бути розміщені в сусідніх вільних клітинках (горизонтально або вертикально).",
			part4:
				"Неможливо розмістити лише один із двох символів. Тому, щоб запобігти передчасному закінченню гри, уникайте ізолювання клітинок.",
		},
		termsOfUse: "Умови використання",
		privacyPolicy: "Політика конфіденційності",
		copyright: {
			originalGame: "Оригінальна гра",
			digitalVersion: "Цифрова версія",
		},
		sourceCodeAvailableAt: "Вихідний код доступний на",
		version: "Версія",
		checkForUpdates: "Перевірити оновлення",
		updateAvailable:
			"Доступне оновлення, завершіть гру та натисніть тут для оновлення",
	},

	languageSelector: {
		chooseLanguage: "Оберіть мову",
		language: "Мова",
		changeLanguageOffline:
			"Не вдалося завантажити переклад: схоже, ваш пристрій не підключений до мережі. Будь ласка, переконайтеся, що ваш пристрій має доступ до Інтернету, та спробуйте знову.",
		changeLanguageError:
			"Сталася помилка під час налаштування нової мови. Будь ласка, перезапустіть додаток та спробуйте знову.",
	},

	navigationBlocker: {
		title: "Це зупинить поточну гру, ви впевнені?",
		description: "Будь ласка, підтвердіть, що хочете зупинити поточну гру.",
		confirmationCheckbox: "Завжди питати підтвердження перед перериванням гри",
		keepPlaying: "Продовжити гру",
		stopGame: "Зупинити гру",
	},

	newGameDialog: {
		close: "Закрити",
		createGame: "Створити гру",
		joinGame: "Приєднатися до гри",
		pickAnotherDay: "Обрати інший день",
		play: "Грати",
		playRandomGame: "Грати випадкову гру",
		playTodayGame: "Грати сьогоднішню гру",
		playWithFriends: "Грати з друзями",
		shareCreate: {
			scanQrCode:
				"Попросіть друзів відсканувати цей QR-код або поділіться з ними посиланням.",
			clickPlay: "Потім натисніть Грати.",
			title: "Detrak",
			joinMe: "🎲 Приєднуйтеся до мене в цій грі Detrak!",
			shareLink: "Поділитися посиланням",
			copyLink: "Скопіювати посилання в буфер обміну",
		},
		shareJoin: {
			useCamera: "Використовуйте камеру пристрою для сканування QR-коду гри.",
			openGameLink: "Або відкрийте посилання на гру.",
			enterGameLink: "Або введіть посилання на гру нижче та натисніть Грати.",
		},
		stopGame: "Зупинити гру",
		title: {
			createGame: "Створити гру",
			inviteToGame: "Запросити людей до поточної гри",
			joinGame: "Приєднатися до гри",
			newGame: "Нова гра",
			playWithFriends: "Грати з друзями",
			welcomeToNewVersion: "Ласкаво просимо до нової версії Detrak!",
		},
		welcome: {
			intro: "Є два нові способи гри:",
			dailyGame: "Щоденна гра",
			dailyGameDetails:
				"щодня послідовність символів, що випадають на кістках, однакова для всіх.",
			playWithFriends: "Грати з друзями",
			playWithFriendsDetails:
				"створіть гру та запросіть людей приєднатися. Тут теж послідовність символів, що випадають під час гри, однакова для ваших друзів і вас. Працює навіть без інтернет-з'єднання!",
			startPlaying: "Почати грати!",
		},
		or: "або",
	},

	themeSelector: {
		chooseTheme: "Оберіть тему",
		theme: "Тема",
		sameAsDevice: "Як на пристрої",
		light: "Світла",
		dark: "Темна",
	},

	settingsDialog: {
		openSettingsDialog: "Відкрити діалог налаштувань",
		settings: "Налаштування",

		alwaysShowScore: {
			title: "Завжди показувати рахунок",
			description: "Показує ваш поточний рахунок під час гри.",
		},

		showScoreWithContrast: {
			title: "Показувати рахунок з контрастом замість кольору",
			description:
				"Використовує відтінки сірого замість червоного, зеленого та синього.",
		},

		showScoreLegend: {
			title: "Показувати легенду рахунку",
			description: "Показує легенду, розміщену над сіткою.",
		},

		animateDice: {
			title: "Анімувати кидок кісток",
			description: "Кидає кості з 3D-анімацією.",
		},

		autoRollDice: {
			title: "Автоматично кидати кості",
			notAvailableDuringTheFirstGame: "(недоступно під час першої гри)",
			description:
				"Автоматично кидає кості після розміщення двох символів у сітці. Це прибирає можливість скасувати розміщення другого символу.",
		},

		showDiceMarker: {
			title: "Показувати маркер кісток",
			description: "Показує, який символ потрібно розмістити в сітці.",
		},

		showConfetti: {
			title: "Показувати конфеті",
			description: "Запускає вибух конфеті, коли ви б'єте свій рекорд!",
		},

		gridAtBottom: {
			title: "Розмістити сітку внизу екрана",
			description: "Корисно для гри однією рукою на мобільному пристрої.",
		},

		enableWakeLock: {
			title: "Не вимикати екран під час гри",
			description:
				"Запобігає вимкненню екрана пристрою на п'ять хвилин під час гри. Зауважте, що деякі пристрої Apple не підтримують цю функцію.",
		},

		showNavigationAlert: {
			title: "Питати підтвердження перед виходом з гри",
			description:
				"Показує діалог підтвердження при переході в інше місце під час гри.",
		},
	},

	siteHeader: {
		detrak: "Detrak",
	},
};
